Name - Ankit
Roll No.-19MTS5630
Class-BSc Mathematical Science 2nd year(3rd sem)
Date-05 Oct 2020

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
#mouting drive to colab
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [ ]:
#reading file from drive
data1=pd.read_csv('/content/gdrive/My Drive/DataSets/ex1.csv')
data1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
#reading file by speciyying the deimiter
data2 = pd.read_table('/content/gdrive/My Drive/DataSets/ex1.csv', sep=',')
data2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
#if header is missing, the first row of the data will be act as header
data3 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex2.csv')
data3

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [ ]:
# we can mention the header while reading the dataset
data3 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex2.csv', header=None)
data4

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [ ]:
# we can also specify our own header while reading the data
data3 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex2.csv', names=['a','b','c','d','message'])
data3

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
#we can also specify the row index labels using items o
names = ['a', 'b', 'c', 'd', 'message']
data3 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex2.csv', names=names, index_col='message')
data3

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [ ]:
data4 = pd.read_csv('/content/gdrive/My Drive/DataSets/csv_mindex.csv')
data4

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [ ]:
#heirarchy of index
data4 = pd.read_csv('/content/gdrive/My Drive/DataSets/csv_mindex.csv', index_col=['key1','key2'])
data4

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [ ]:
#using "\s+" to count variable whitespaces
data5 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex4.csv')

data5

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [ ]:
#redundant data present in 0,2,3
data5 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex4.csv')
data5

                                              # hey!  ... Unnamed: 4
0                                                  a  ...    message
1  # just wanted to make things more difficult fo...  ...        NaN
2               # who reads CSV files with computers  ...        NaN
3                                                  1  ...      hello
4                                                  5  ...      world
5                                                  9  ...        foo

[6 rows x 5 columns]

In [ ]:
# we are now skipping rows which have redundant data
data5 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex4.csv', skiprows=[0,2,3])
data5

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
#handling missing data
data6 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex5.csv')
data6

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
#checking for null or nan values
pd.isnull(data6)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [ ]:
#we can also specifi our own NA values
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
data6 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex5.csv', na_values=sentinels)
data6

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [ ]:
pd.isnull(data6)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1       True  False  False   True  False    False
2      False  False  False  False  False     True

In [ ]:
#reading datasets in pieces

In [ ]:
# we set the display setting i.e max number of rows at one time
pd.options.display.max_rows = 10

In [ ]:
# default display settings
data7 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex6.csv')
data7

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [ ]:
#using nrows we can read specific number of rows
data7 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex6.csv', nrows=5)
data7

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [ ]:
#To read a file in pieces, we can specify a chunksize as a number of rows:
data7 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex6.csv', chunksize=1000)
data7

In [ ]:
total = pd.Series([])
for piece in data7:
  total = total.add(piece['key'].value_counts(), fill_value=0)

total = total.sort_values(ascending=False)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [ ]:
total[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [ ]:
#writing to datafile

In [ ]:
data8 = pd.read_csv('/content/gdrive/My Drive/DataSets/ex5.csv')
data8

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
data8.to_csv('/content/gdrive/My Drive/DataSets/out1.csv')

In [ ]:
pd.read_csv('/content/gdrive/My Drive/DataSets/out1.csv')

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo